In [4]:
# import all needed modules
from sqlalchemy import create_engine
from sql_pass import password
import matplotlib.pyplot as plt
import psycopg2  
import pandas as pd

In [5]:
# create a sqlalchemy engine to import our sql database and then establish a connection.
engine = create_engine("postgresql://postgres:{password}@localhost:5432/Employee_db".format(password=password))
conn = engine.connect()

In [6]:
# convert sql tables into pandas dataframe. 
salaries_df = pd.read_sql('select * from salaries', conn)
salaries_df.head()

   emp_no      salary
0   10001  $60,117.00
1   10002  $65,828.00
2   10003  $40,006.00
3   10004  $40,054.00
4   10005  $78,228.00

In [ ]:
plt.hist(salaries_df['salary'])
plt.xlabel('Salary')
plt.ylabel('Employees Number')
plt.show()

In [28]:
# run a sql query type to extract the needed information for bar plot. triple quotation for very long string.
title_df = pd.read_sql("""select
                       t.title,
                       s.salary
                       FROM employees e
                       left join titles t
                       on t.title_id = e.emp_title_id
                           left join salaries s
                           on s.emp_no = e.emp_no""", conn  
                       )

title_df.head()

              title      salary
0   Senior Engineer  $40,000.00
1  Technique Leader  $43,548.00
2          Engineer  $40,023.00
3             Staff  $71,042.00
4   Senior Engineer  $46,740.00

In [ ]:
avg_title_df = pd.read_sql("""select
                       t.title,
                       avg(s.salary) as avg_salary
                       FROM employees e
                       left join titles t
                       on t.title_id = e.emp_title_id
                           left join salaries s
                           on s.emp_no = e.emp_no
                       groub by title
                       order by avg_salary""", conn  
                       )
avg_title_df.head()

In [40]:
title_plot_data = title_df.groupby(['title']).mean()
title_plot_data

DataError: No numeric types to aggregate

In [38]:
title_num = title_plot_data.keys()
plt.bar(title_num, title_plot_data, align='center')
plt.title('Average Salary by Title')
plt.xlabel('Title')
plt.ylabel('Average Salary')
plt.xticks(rotation=45)
plt.show()

TypeError: no numeric data to plot

In [42]:
# well looks like the boss have a sense of humor.......
epilogue_df = pd.read_sql('select * from employees where emp_no = 499942', conn)
epilogue_df

   emp_no emp_title_id  birth_date first_name last_name sex   hire_date
0  499942        e0004  1963-01-10      April  Foolsday   F  1997-02-10